# Microsoft Movie Studios

In [1]:
# Import relevant modules

import pandas as pd
import numpy as np
import matplotlib.patches as mpatches
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
df1 = pd.read_csv('data/title.basics.csv')
df2 = pd.read_csv('data/title.ratings.csv')
df3 = pd.read_csv('data/bom.movie_gross.csv')
df4 = pd.read_csv('data/tn.movie_budgets.csv')

df1.shape, df2.shape, df3.shape, df3.shape

((146144, 6), (73856, 3), (3387, 5), (3387, 5))

### DF1

This data set contains titles, premiere year, runtime and film genres, along with an index.

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [4]:
df1['genres'].value_counts()

Documentary                    32185
Drama                          21486
Comedy                          9177
Horror                          4372
Comedy,Drama                    3519
                               ...
History,Mystery                    1
Animation,Family,Mystery           1
Adventure,History,Sci-Fi           1
Biography,Comedy,Reality-TV        1
Adventure,History,Western          1
Name: genres, Length: 1085, dtype: int64

In [5]:
len(df1['tconst'].unique()) # the output matches the number of entries for 'tconst'.  The values are unique

146144

### DF2

This data set contains fan rating and voting information along with an index.

In [6]:
df2.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [7]:
df2['averagerating'].value_counts(bins=10)

(6.4, 7.3]     19088
(5.5, 6.4]     16563
(7.3, 8.2]     12473
(4.6, 5.5]      9861
(3.7, 4.6]      5452
(8.2, 9.1]      5354
(2.8, 3.7]      2819
(1.9, 2.8]      1112
(9.1, 10.0]      715
(0.99, 1.9]      419
Name: averagerating, dtype: int64

In [8]:
df2['numvotes'].value_counts(bins=12)

(-1836.062, 153426.75]     73443
(153426.75, 306848.5]        243
(306848.5, 460270.25]         91
(460270.25, 613692.0]         45
(613692.0, 767113.75]         22
(767113.75, 920535.5]          4
(920535.5, 1073957.25]         3
(1073957.25, 1227379.0]        2
(1687644.25, 1841066.0]        1
(1380800.75, 1534222.5]        1
(1227379.0, 1380800.75]        1
(1534222.5, 1687644.25]        0
Name: numvotes, dtype: int64

In [9]:
len(df2['tconst'].unique()) # the output matches the number of entries for 'tconst'.  The values are unique

73856

### DF3

This data set contains titles, production studio, year of release from 2010 - 2018, and domestic and foreign gross receipts.

In [10]:
df3.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [11]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [12]:
# Updating column names for readability in graphs
df3['studio'].replace({"WB (NL)": "WB"}, inplace=True)
df3['studio'].replace({"WB": "Warner Bros", 'BV': 'Disney', 'Uni.': "Universal", 'P/DW': 'DreamWorks', 'Par.': 'Paramount'}, inplace=True)
df3['studio'].value_counts()

Warner Bros    185
IFC            166
Universal      147
Magn.          136
Fox            136
              ...
IW               1
AaF              1
Cleopatra        1
Synergetic       1
YFG              1
Name: studio, Length: 256, dtype: int64

### DF4

In [13]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

## My initial process:

In the initial view of the three data files, a few things stood out.
1.  All three files had low number of null values.
2.  The two files from IMDB had an index that appeared to be common between the them.
3.  The file containing the gross receipts info had considerably less rows than the other two.  This file
    is going to strongly influence the size of the merged data set.

## Data Preparation

Each dataset contains pieces of information vital to making an analysis.  My process is:
    
    Doing a left merge on df1 and df2 by 'tconst' to create the dataset df_imbd
    Doing a right merge on df_bom and df4 on the 'title' column
    Doing an right merge on df_imbd and df_money by 'title' to create a complete dataset.
    Cleaning up the data:
        1.  Delete the 'original_title', 'start_year' and the 'runtime_minutes" columns
        2.  Change the foreign_gross column to float64 Dtype from object Dtype
        3.  Add a column that is the sum of 'domestic_gross' and 'foreign_gross' entitled 'worldwide_gross'
        4.  Delete duplicates in the title column

### Merging datasets

In [14]:
df_imdb = df1.merge(df2, on="tconst", how = 'left')
df_imdb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146144 entries, 0 to 146143
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
 6   averagerating    73856 non-null   float64
 7   numvotes         73856 non-null   float64
dtypes: float64(3), int64(1), object(4)
memory usage: 10.0+ MB

In [15]:
df_imdb['primary_title'].isin(df3['title']).value_counts()

False    142780
True       3364
Name: primary_title, dtype: int64

First, we'll rename the 'primary_title' column in 'df_imdb' to 'title'

In [16]:
df_imdb.rename(columns={'primary_title': 'title'}, inplace=True)

Now we'll prepare the the df3 and df4 files for merging, which contains financial and studio data.

In [17]:
df_bom = df3.drop(['domestic_gross','foreign_gross'], axis = 1)

In [18]:
df4.rename(columns={'movie': 'title'}, inplace=True)

In [19]:
df_money = df_bom.merge(df4, on = 'title', how = 'right')
df_money

,title,studio,year,id,release_date,production_budget,domestic_gross,worldwide_gross
0,Avatar,NaN,NaN,1,"Dec 18, 2009","$425,000,000","$760,507,625","$2,776,345,279"
1,Pirates of the Caribbean: On Stranger Tides,Disney,2011.0,2,"May 20, 2011","$410,600,000","$241,063,875","$1,045,663,875"
2,Dark Phoenix,NaN,NaN,3,"Jun 7, 2019","$350,000,000","$42,762,350","$149,762,350"
3,Avengers: Age of Ultron,Disney,2015.0,4,"May 1, 2015","$330,600,000","$459,005,868","$1,403,013,963"
4,Star Wars Ep. VIII: The Last Jedi,NaN,NaN,5,"Dec 15, 2017","$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...,...,...
5777,Red 11,NaN,NaN,78,"Dec 31, 2018","$7,000",$0,$0
5778,Following,NaN,NaN,79,"Apr 2, 1999","$6,000","$48,482","$240,495"
5779,Return to the Land of Wonders,NaN,NaN,80,"Jul 13, 2005","$5,000","$1,338","$1,338"
5780,A Plague So Pleasant,NaN,NaN,81,"Sep 29, 2015","$1,400",$0,$0
5781,My Date With Drew,NaN,NaN,82,"Aug 5, 2005","$1,100","$181,041","$181,041"

This merge did not completely give the results we wanted, but was the best of the options available.  It resulted in having to hard code some data to complete our top grossing movies list.

Now we'll merge the IMBd data with the BOM data, which has all the gross receipts details.  The commonality between these files is the titles; of the 3387 rows in the BOM data file, 3025 of them have matching data in the 'title' column with the 'primary_title' column in the IMDb file.

In [20]:
df_all3 = df_imdb.merge(df_money, on="title", how = 'right')

In [21]:
df_all3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7221 entries, 0 to 7220
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   tconst             3815 non-null   object
 1   title              7221 non-null   object
 2   original_title     3814 non-null   object
 3   start_year         3815 non-null   float64
 4   runtime_minutes    3328 non-null   float64
 5   genres             3743 non-null   object
 6   averagerating      2875 non-null   float64
 7   numvotes           2875 non-null   float64
 8   studio             1681 non-null   object
 9   year               1682 non-null   float64
 10  id                 7221 non-null   int64
 11  release_date       7221 non-null   object
 12  production_budget  7221 non-null   object
 13  domestic_gross     7221 non-null   object
 14  worldwide_gross    7221 non-null   object
dtypes: float64(5), int64(1), object(9)
memory usage: 902.6+ KB

### Data Cleaning

In [22]:
# remove all but numbers in  the gross earnings columns
df_all3['domestic_gross'] = df_all3['domestic_gross'].apply(str).str.replace(r"[a-zA-Z$,]",'')
df_all3['worldwide_gross'] = df_all3['worldwide_gross'].apply(str).str.replace(r"[a-zA-Z$,]",'')

In [23]:
# convert gross earnings columns to numeric
df_all3['domestic_gross'] = pd.to_numeric(df_all3['domestic_gross'], errors = 'coerce')
df_all3['worldwide_gross'] = pd.to_numeric(df_all3['worldwide_gross'], errors = 'coerce')

In [24]:
df_all3 = df_all3.drop_duplicates(subset=['title'])

In [25]:
df_all3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5698 entries, 0 to 7220
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   tconst             2312 non-null   object
 1   title              5698 non-null   object
 2   original_title     2312 non-null   object
 3   start_year         2312 non-null   float64
 4   runtime_minutes    2138 non-null   float64
 5   genres             2287 non-null   object
 6   averagerating      2033 non-null   float64
 7   numvotes           2033 non-null   float64
 8   studio             1237 non-null   object
 9   year               1238 non-null   float64
 10  id                 5698 non-null   int64
 11  release_date       5698 non-null   object
 12  production_budget  5698 non-null   object
 13  domestic_gross     5698 non-null   int64
 14  worldwide_gross    5698 non-null   int64
dtypes: float64(5), int64(3), object(7)
memory usage: 712.2+ KB

In [26]:
# Save cleaned dataset as CSV
df_all3.to_csv('./data/df_all3.csv')